MikroElektronika/core_packages/dsPIC/XC16/def/PIC24F16KM102/mcu.h
#define _CLC1GLSL_G1D1T_POSITION                 0x00000001
#define _CLC1GLSL_G1D1T_MASK                     0x00000002
#define _CLC1GLSL_G1D1T_LENGTH                   0x00000001

#define _CLC1GLSL_G1D2N_POSITION                 0x00000002
#define _CLC1GLSL_G1D2N_MASK                     0x00000004
#define _CLC1GLSL_G1D2N_LENGTH                   0x00000001

#define _CLC1GLSL_G1D2T_POSITION                 0x00000003
#define _CLC1GLSL_G1D2T_MASK                     0x00000008
#define _CLC1GLSL_G1D2T_LENGTH                   0x00000001

#define _CLC1GLSL_G1D3N_POSITION                 0x00000004
#define _CLC1GLSL_G1D3N_MASK                     0x00000010
#define _CLC1GLSL_G1D3N_LENGTH                   0x00000001

#define _CLC1GLSL_G1D3T_POSITION                 0x00000005
#define _CLC1GLSL_G1D3T_MASK                     0x00000020
#define _CLC1GLSL_G1D3T_LENGTH                   0x00000001

#define _CLC1GLSL_G1D4N_POSITION                 0x00000006
#define _CLC1GLSL_G1D4N_MASK                     0x00000040
#define _CLC1GLSL_G1D4N_LENGTH                   0x00000001

#define _CLC1GLSL_G1D4T_POSITION                 0x00000007
#define _CLC1GLSL_G1D4T_MASK                     0x00000080
#define _CLC1GLSL_G1D4T_LENGTH                   0x00000001

#define _CLC1GLSL_G2D1N_POSITION                 0x00000008
#define _CLC1GLSL_G2D1N_MASK                     0x00000100
#define _CLC1GLSL_G2D1N_LENGTH                   0x00000001

#define _CLC1GLSL_G2D1T_POSITION                 0x00000009
#define _CLC1GLSL_G2D1T_MASK                     0x00000200
#define _CLC1GLSL_G2D1T_LENGTH                   0x00000001

#define _CLC1GLSL_G2D2N_POSITION                 0x0000000A
#define _CLC1GLSL_G2D2N_MASK                     0x00000400
#define _CLC1GLSL_G2D2N_LENGTH                   0x00000001

#define _CLC1GLSL_G2D2T_POSITION                 0x0000000B
#define _CLC1GLSL_G2D2T_MASK                     0x00000800
#define _CLC1GLSL_G2D2T_LENGTH                   0x00000001

#define _CLC1GLSL_G2D3N_POSITION                 0x0000000C
#define _CLC1GLSL_G2D3N_MASK                     0x00001000
#define _CLC1GLSL_G2D3N_LENGTH                   0x00000001

#define _CLC1GLSL_G2D3T_POSITION                 0x0000000D
#define _CLC1GLSL_G2D3T_MASK                     0x00002000
#define _CLC1GLSL_G2D3T_LENGTH                   0x00000001

#define _CLC1GLSL_G2D4N_POSITION                 0x0000000E
#define _CLC1GLSL_G2D4N_MASK                     0x00004000
#define _CLC1GLSL_G2D4N_LENGTH                   0x00000001

#define _CLC1GLSL_G2D4T_POSITION                 0x0000000F
#define _CLC1GLSL_G2D4T_MASK                     0x00008000
#define _CLC1GLSL_G2D4T_LENGTH                   0x00000001

#define _CLC1GLSH_G3D1N_POSITION                 0x00000000
#define _CLC1GLSH_G3D1N_MASK                     0x00000001
#define _CLC1GLSH_G3D1N_LENGTH                   0x00000001

#define _CLC1GLSH_G3D1T_POSITION                 0x00000001
#define _CLC1GLSH_G3D1T_MASK                     0x00000002
#define _CLC1GLSH_G3D1T_LENGTH                   0x00000001

#define _CLC1GLSH_G3D2N_POSITION                 0x00000002
#define _CLC1GLSH_G3D2N_MASK                     0x00000004
#define _CLC1GLSH_G3D2N_LENGTH                   0x00000001

#define _CLC1GLSH_G3D2T_POSITION                 0x00000003
#define _CLC1GLSH_G3D2T_MASK                     0x00000008
#define _CLC1GLSH_G3D2T_LENGTH                   0x00000001

#define _CLC1GLSH_G3D3N_POSITION                 0x00000004
#define _CLC1GLSH_G3D3N_MASK                     0x00000010
#define _CLC1GLSH_G3D3N_LENGTH                   0x00000001

#define _CLC1GLSH_G3D3T_POSITION                 0x00000005
#define _CLC1GLSH_G3D3T_MASK                     0x00000020
#define _CLC1GLSH_G3D3T_LENGTH                   0x00000001

#define _CLC1GLSH_G3D4N_POSITION                 0x00000006
#define _CLC1GLSH_G3D4N_MASK                     0x00000040
#define _CLC1GLSH_G3D4N_LENGTH                   0x00000001

#define _CLC1GLSH_G3D4T_POSITION                 0x00000007
#define _CLC1GLSH_G3D4T_MASK                     0x00000080
#define _CLC1GLSH_G3D4T_LENGTH                   0x00000001

#define _CLC1GLSH_G4D1N_POSITION                 0x00000008
#define _CLC1GLSH_G4D1N_MASK                     0x00000100
#define _CLC1GLSH_G4D1N_LENGTH                   0x00000001

#define _CLC1GLSH_G4D1T_POSITION                 0x00000009
#define _CLC1GLSH_G4D1T_MASK                     0x00000200
#define _CLC1GLSH_G4D1T_LENGTH                   0x00000001

#define _CLC1GLSH_G4D2N_POSITION                 0x0000000A
#define _CLC1GLSH_G4D2N_MASK                     0x00000400
#define _CLC1GLSH_G4D2N_LENGTH                   0x00000001

#define _CLC1GLSH_G4D2T_POSITION                 0x0000000B
#define _CLC1GLSH_G4D2T_MASK                     0x00000800
#define _CLC1GLSH_G4D2T_LENGTH                   0x00000001

#define _CLC1GLSH_G4D3N_POSITION                 0x0000000C
#define _CLC1GLSH_G4D3N_MASK                     0x00001000
#define _CLC1GLSH_G4D3N_LENGTH                   0x00000001

#define _CLC1GLSH_G4D3T_POSITION                 0x0000000D
#define _CLC1GLSH_G4D3T_MASK                     0x00002000
#define _CLC1GLSH_G4D3T_LENGTH                   0x00000001

#define _CLC1GLSH_G4D4N_POSITION                 0x0000000E
#define _CLC1GLSH_G4D4N_MASK                     0x00004000
#define _CLC1GLSH_G4D4N_LENGTH                   0x00000001

#define _CLC1GLSH_G4D4T_POSITION                 0x0000000F
#define _CLC1GLSH_G4D4T_MASK                     0x00008000
#define _CLC1GLSH_G4D4T_LENGTH                   0x00000001

#define _CCP1CON1L_MOD_POSITION                  0x00000000
#define _CCP1CON1L_MOD_MASK                      0x0000000F
#define _CCP1CON1L_MOD_LENGTH                    0x00000004

#define _CCP1CON1L_CCSEL_POSITION                0x00000004
#define _CCP1CON1L_CCSEL_MASK                    0x00000010
#define _CCP1CON1L_CCSEL_LENGTH                  0x00000001

#define _CCP1CON1L_T32_POSITION                  0x00000005
#define _CCP1CON1L_T32_MASK                      0x00000020
#define _CCP1CON1L_T32_LENGTH                    0x00000001

#define _CCP1CON1L_TMRPS_POSITION                0x00000006
#define _CCP1CON1L_TMRPS_MASK                    0x000000C0
#define _CCP1CON1L_TMRPS_LENGTH                  0x00000002

